languages/english-ask.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-22 Fri 21:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Dumb questions in English</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Quan Vu" />
<link rel="stylesheet" href="https://vhquan.github.io/css/style.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">Dumb questions in English</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge797aa4">1. What is the difference between the phrase "as fas as I know" and "for all I know"?</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge797aa4" class="outline-2">
<h2 id="orge797aa4"><span class="section-number-2">1</span> What is the difference between the phrase "as fas as I know" and "for all I know"?</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>"For all I know"</b> is often used in situations where the statement that you are
 qualifying with this phrase runs completely contrary to what was said right
 before that, or is a wild guess that would change everything compared to what
 was said before.
</p>

<blockquote>
<p>
I don't know why his opinion of these products is so favorable. He could be an
investor in the company that produces them, <b>for all I know</b>.
</p>
</blockquote>

<p>
<b>"As far as I know"</b> is not used alongside guesses. It means that you are
 offering information that is based on what you actually know, but you don't
 know a lot, or you could be mistaken.
</p>
<hr />
<p>
<b>For all I know.</b> Peopel typically say this when they think they know very
little or nothing about a subject. (They have no expertise at all). (Theo như
tao biết&#x2026;)
<b>As far as I know</b>. People typically say this when they know at least a little
bit about something and may even be true experts in the field, but are
granting that no one ever knows everything. (Theo như những gì tao học
thì/theo kiến thức của tao thì &#x2026;)
</p>
</div>
</div>
</div>
</body>
</html>
